#include <stdio.h>

int main()
{

    /* 二维数组初始化 */

    // 规整的二维数组
    int a[3][4] = {
        {1, 2, 3, 4},
        {5, 6, 7, 8},
        {9, 10, 11, 12},
    };

    // 一般会将其写成一维数组的形式
    int a1[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};

    // 行数可以省略，根据总数和列数可以推断行数
    int a2[][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};

    /* 二维数组遍历 */

    // 二维数组的遍历
    int i = 0;
    int j = 0;
    int n = sizeof(a) / sizeof(a[0]);
    int nj = sizeof(a[0]) / sizeof(a[0][0]);
    for(i = 0; i < n; i++)
    {
        for(j = 0; j < nj; j++)
        {
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }

    /* 二维数组，数组名代表的含义 */
    printf("a: %d, a+1: %d\n", a, a+1);
    // a: -421310000, a+1: -421309984 - 相差 16，4 个 int
    printf("%d, %d\n", *(a+0), *(a+1));
    printf("%d, %d\n", a[0], a[1]);
    printf("%d, %d\n", a[0], a[0] + 1);

    // a: 第0行首地址
    // a+i ~ &a[i]: 第i行首地址
    // *(a+i) ~ a[i]: 第i行首元素地址
    // *(a+i)+j ~ &a[i][j]: 第i行第j列元素地址
    // *(*(a+i)+j) ~ a[i][j]: 第i行第j列元素的值
    // 总结：首行地址和首元素地址是一样的，但是它们的步长是不一样的
    // a+i: 第i行首地址
    // *(a+i): 第i行首元素地址
    // *(a+i)+j: 第i行第j列元素地址

    return 0;
}